---
kind: method
id: M:Autodesk.Revit.DB.FamilySymbol.HasThermalProperties
zh: 族类型、族符号
source: html/feb0c72e-8845-6678-fd43-5fc682c26ce8.htm
---
# Autodesk.Revit.DB.FamilySymbol.HasThermalProperties Method

**中文**: 族类型、族符号

Identifies if this FamilySymbol can include thermal properties.

## Syntax (C#)
```csharp
public bool HasThermalProperties()
```

## Returns
True if the FamilySymbol can include thermal properties, false otherwise.